package com.flash.common.model;

public enum CodeEnum {

    /**
     * 服务端系统级固定响应码
     */
    code8200(200, 8200, "执行成功"),
    code8995(500, 8995, "验证码发送失败"),
    code8996(500, 8996, "提示错误"),
    code8997(500, 8997, "参数错误"),
    code8998(500, 8998, "数据库错误"),
    code8999(500, 8999, "服务器错误"),
    // 登录超时，重新登录（改错误吗不可重复）
    LOGIN_TIMEOUT(403, 9000, "请重新登录"),
    code990001(500, 990001, "不支持的mime请求类型"),
    code990002(500, 990002, "请求contentType 错误"),
    code990003(500, 990003, "请求文件大小超限"),
    code990004(500, 990004, "通讯协议参数 data / data_type 缺失"),
    code990005(500, 990005, "所指定的通讯协议版本无效"),
    code990006(500, 990006, "协议包解析错误"),
    code990007(500, 990007, "解析器无法定位模板视图"),
    code990008(500, 990008, "未知的请求 mime 类型"),

    /**
     * API接口级固定响应码
     */
    code990501(201, 990501, "请求参数无效(缺失，或为空，或不符合规则)"),
//    code990502(201, 990502, "请求token无效"),
    code990503(201, 990503, "请求权限无效"),
    code990504(201, 990504, "验证码错误"),
    code990505(201, 990505, "请求业务执行失败"),
    code990506(201, 990506, "没有响应数据，即响应结果数据(result)不存在"),
    code990507(201, 990507, "请求已经过期"),
    code990508(201, 990508, "请求签名认证无效"),

    /**
     * 业务级响应码
     */
    // 直播服务系统(LVS)
    code9020101(201, 9020101, "当前用户不是主播"),
    code9020102(201, 9020102, "该主播没有开通直播房间"),
    code9020103(201, 9020103, "创建直播房间聊天室失败"),
    code9020104(201, 9020104, "该直播房间没有绑定主播助理"),
    code9020105(201, 9020105, "该直播房间绑定的主播助理用户信息不存在"),
    code9020106(201, 9020106, "该主播用户不存在"),
    code9020501(201, 9020501, "该直播房间不存在"),
    code9022101(201, 9022101, "金钻余额不足，请充值"),
    code9020107(201, 9020107, "用户没权限进入该房间"),

    //用户认证系统（UDS/03）
    code9030101(503, 9030101, "出错啦，请稍后再试"),
    code9030102(201, 9030102, "该账号已注册，请前往登录"),
    code9030103(503, 9030103, "验证码发送失败"),
    code9030104(403, 9030104, "账号或者密码错误， 请重新输入"),
    code9030105(201, 9030105, "该用户未注册"),
    code9030106(201, 9030106, "微信用户不存在"),
    code9030107(201, 9030107, "验证码错误"),
    code9030108(201, 9030108, "公司或者个人已认证"),
    code9030109(201, 9030109, "该项目已经存在"),
    code9030110(201, 9030110, "公司已认证或者认证中"),
    code9030111(201, 9030111, "不可以读取其他人的消息"),
    code9030201(503, 9030201, "验证码发送失败"),
    code9030401(403, 9030401, "账号或者密码错误， 请重新输入"),
    code9030402(201, 9030402, "账号或者密码错误， 请重新输入"),
    code9030403(201, 9030403, "出错啦，请稍后再试"),
    code9030501(403, 9030501, "账号或者密码错误， 请重新输入"),
    code9030601(403, 9030601, "数据库查询为空"),
    code9030801(503, 9030801, "出错啦，请稍后再试"),
    code9030802(403, 9030802, "该昵称已经被使用"),
    code9030803(403, 9030803, "昵称不允许为空"),
    code9031301(503, 9031301, "出错啦，请稍后再试"),
    code9031401(403, 9031401, "账号或者密码错误， 请重新输入"),
    code9031601(503, 9031601, "出错啦，请稍后再试"),
    code9031602(201, 9031602, "用户密码错误"),
    code9033401(201, 9033401, "该用户未注册"),
    code9033601(201, 9033601, "微信用户不存在"),
    code9033602(201, 9033602, "验证码错误"),
    code9033603(201, 9033603, "合并用户使用了相同账号,请登录微信账号"),
    code9033604(201, 9033604, "未找到合并的用户"),
    code9033605(201, 9033605, "合并账号有消费,请人工合并"),
    code9033606(201, 9033606, "超级用户在非允许区域登录"),
    code9033607(201, 9033607, "超级用户长期未修改密码"),
    code9033608(201, 9033608, "已拥有该股票，请输入其他股票"),
    code9033609(201, 9033608, "已保存过该股票预警，请重新输入"),
    code9033610(201, 9033610, "已保存过该做题结果，请勿重复操作"),
    code9033611(201, 9033611, "请不要替用户做风险评测"),
    code9033612(201, 9033612, "公司名称不可为空"),
    //UC登录返回的
    code9033613(201, 9033613, "系统异常，请联系管理员"),
    code9033614(201, 9033613, "用户名不存在或用户已被删除"),
    code9033615(201, 9033613, "密码错误"),
    code9033616(201, 9033613, "手机号码不合法"),
    code9033617(201, 9033613, "写入UC失败"),
    code9033618(201, 9033613, "该用户受保护无权限更改"),
    code9033619(201, 9033613, "修改手机号码失败"),

    // 用户充值服务(UCS/04) 充值响应码
    code9040101(201, 9040101, "用户充值记录生成失败"),
    code9040102(201, 9040102, "用户需要支付金额不足，小于所购套餐价格总和"),
    code9040103(201, 9040103, "用户购买套餐记录生成失败"),
    code9040104(201, 9040104, "设置充值记录支付成功失败"),
    code9040105(201, 9040105, "设置购买套餐记录购买成功失败"),
    code9040106(201, 9040106, "更新用户资产余额信息失败"),
    code9040107(201, 9040107, "更新用户功能信息失败"),
    code9040201(201, 9040201, "序列号对应的充值记录为空"),
    code9040202(201, 9040202, "充值记录状态异常，即已支付或已取消"),
    code9040203(201, 9040203, "充值记录所属用户与当前用户不一致"),
    code9040204(201, 9040204, "支付宝支付出错啦，请稍后再试"),
    code9040205(201, 9040205, "微信支付出错啦，请稍后再试"),
    code9040206(201, 9040206, "找不到支付类型"),
    code9040207(201, 9040207, "微信支付出错啦，请稍后再试"),
    code9040501(201, 9040501, "微信支付出错啦，请稍后再试"),

    code9040502(201, 9040502, "问答记录找不到"),
    code9040503(201, 9040503, "用户账户余额不存在"),
    code9040504(201, 9040504, "用户余额不足"),
    code9040505(201, 9040505, "更新用户余额失败"),
    code9040506(201, 9040506, "添加消费记录失败"),
    code9040507(201, 9040507, "更新问答记录失败"),
    code9040508(201, 9040508, "添加问答退款记录失败"),
    code9040509(201, 9040509, "更新用户充值记录发票状态失败"),
    code9040510(201, 9040510, "用户没有OPENID"),

    // 用户充值服务(UCS/04) 消费响应码
    code9040A01(201, 9041001, "该视频不存在，看看别的视频吧"),
    code9040A02(201, 9041002, "无法购买视频免费"),
    code9040A03(201, 9041003, "已经购买此视频"),
    code9041301(201, 9041301, "该充值记录未充值成功"),
    code9041302(201, 9041302, "用户退款记录生成失败"),
    code9041303(201, 9041303, "用户购买套餐产品未成功或已过期，不能退款"),
    code9041304(201, 9041304, "设置用户购买套餐记录已过期失败"),
    code9041305(201, 9041305, "该充值记录的支付方式不正确，不能退款"),
    code9043001(201, 9043001, "用户消费鉴权不通过"),
    code9043101(201, 9043101, "用户购买的套餐不存在"),
    code9043102(201, 9043102, "用户之前已购买该套餐"),
    code9043103(201, 9043103, "您的积分余额不足"),
    code9043701(201, 9043701, "该问答信息不存在"),
    code9043801(201, 9043801, "您领取听课券不是免费的"),
    code9043802(201, 9043802, "您已经领取了该听课券"),
    code9043803(201, 9043803, "用户今天免费诊股次数已用完"),
    code9043804(201, 9043804, "用户退款更新余额失败"),
    code9043805(201, 9043805, "开票申请提交失败"),

    // 内容搜索服务(LVCS/08) 搜索响应码
    code9080100(201, 9080100, "该讲师不存在"),
    code9080101(201, 9080101, "该点播视频不存在"),
    code9080102(201, 9080102, "该直播房间不存在"),
    code9080103(201, 9080103, "该用户不是讲师"),
    code9080104(201, 9080104, "该微营销不存在"),

    // 用户问答服务(UQAS/09) 搜索响应码
    code9090100(201, 9090100, "该问题不是待回复状态"),
    code9090101(201, 9090101, "该产品ID不存在"),
    code9090102(201, 9090102, "该支付状态不是已冻结状态"),
    code9090103(201, 9090103, "该支付状态不是已支付状态"),
    code9090104(201, 9090104, "添加提问记录失败"),
    code9090105(201, 9090105, "消费提问失败"),

    /**
     * 个人信息
     */
    code9990101(201, 9090101, "用户信息不存在"),
    code9990102(201, 9090102, "企业信息不存在");
;
    /**
     * 对应的httpcode，参照用
     */
    private int httpCode;

    /**
     * 业务code
     */
    private int code;

    /**
     * 描述信息
     */
    private String desc;

    CodeEnum(int httpCode, int code, String desc) {
        this.httpCode = httpCode;
        this.code = code;
        this.desc = desc;
    }

    public static boolean isSuccess(int code) {
        if (code == code8200.getCode()) {
            return true;
        }
        return false;
    }

    public int getHttpCode() {
        return httpCode;
    }

    public void setHttpCode(int httpCode) {
        this.httpCode = httpCode;
    }

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getDesc() {
        return desc;
    }

    public void setDesc(String desc) {
        this.desc = desc;
    }

    public static int getHttpCodeByCode(int code) {
        CodeEnum[] codes = CodeEnum.values();
        for (CodeEnum c : codes) {
            if (c.getCode() == code) {
                return c.getHttpCode();
            }
        }
        return CodeEnum.code8999.httpCode;
    }
}
